In [95]:
import pandas as pd
import numpy as np
df = pd.read_csv(r"C:\Users\Prasad\Downloads\data\data\sample_data.csv", index_col =0 )

In [97]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [75]:
df.loc['Jane']

state        NY
color      blue
food      Steak
age          30
height      165
score       4.6
Name: Jane, dtype: object

In [76]:
df['food'] ## selecting single column

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

In [77]:
df[['food','color','score']] ## selecting multiple columns

             food  color  score
Jane        Steak   blue    4.6
Niko         Lamb  green    8.3
Aaron       Mango    red    9.0
Penelope    Apple  white    3.3
Dean       Cheese   gray    1.8
Christina   Melon  black    9.5
Cornelia    Beans    red    2.2

In [78]:
df.loc['Niko']

state        TX
color     green
food       Lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

In [79]:
df.iloc[3]  ## selecting a single row

state        AL
color     white
food      Apple
age           4
height       80
score       3.3
Name: Penelope, dtype: object

In [80]:
df.iloc[[5, 2, 4]]  ## selecting multiple rows

          state  color    food  age  height  score
Christina    TX  black   Melon   33     172    9.5
Aaron        FL    red   Mango   12     120    9.0
Dean         AK   gray  Cheese   32     180    1.8

In [81]:
df.iloc[3:5] ## selecting  a range of rows excluding the last index

         state  color    food  age  height  score
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [82]:
df.iloc[2:5,2:5] ## selecting row and column together

            food  age  height
Aaron      Mango   12     120
Penelope   Apple    4      80
Dean      Cheese   32     180

In [83]:
df.iloc[:,5] ## selecting all rows for a specific column

Jane         4.6
Niko         8.3
Aaron        9.0
Penelope     3.3
Dean         1.8
Christina    9.5
Cornelia     2.2
Name: score, dtype: float64

In [84]:
food =df['food']
food

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

In [85]:
df.loc[2]

KeyError: 2

In [ ]:
df

In [89]:
df.loc['Niko':'Dean']

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [99]:
df.loc['Niko']

state        TX
color     green
food       Lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

In [103]:
df.loc[['Niko','Penelope']]

         state  color   food  age  height  score
Niko        TX  green   Lamb    2      70    8.3
Penelope    AL  white  Apple    4      80    3.3

In [107]:
df.loc['Niko':'Dean']  ## Note it includes the last index value also

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [113]:
df.loc[['Dean','Cornelia'],['age', 'state', 'score']]

          age state  score
Dean       32    AK    1.8
Cornelia   69    TX    2.2

In [117]:
df.loc[:,['food','color']]

             food  color
Jane        Steak   blue
Niko         Lamb  green
Aaron       Mango    red
Penelope    Apple  white
Dean       Cheese   gray
Christina   Melon  black
Cornelia    Beans    red